### Importing Packages

In [49]:
##Main libraries
import pandas as pd
import numpy as np

##Visualization Libraries
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px
import plotly.graph_objects as go
from plotly.subplots import make_subplots
import plotly.colors as pc


##Libraries to Preprocessing
from sklearn.preprocessing import StandardScaler, LabelEncoder

## Clustering model
from sklearn.cluster import KMeans
import scipy.cluster.hierarchy as sch
from sklearn.cluster import AgglomerativeClustering

## ignore warnings
import warnings
warnings.filterwarnings('ignore')

### Import and Load Data

In [2]:
#Read data
df = pd.read_csv('C:/Users/ostab/Downloads/Mall-Customers-Segmentation/Mall_Customers_Data.csv')
df.head(10)##Take sample from data

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40
5           6  Female   22                  17                      76
6           7  Female   35                  18                       6
7           8  Female   23                  18                      94
8           9    Male   64                  19                       3
9          10  Female   30                  19                      72

In [3]:
#Show the num. of cols and rows
df.shape

(200, 5)

In [4]:
#Rename 'Annual Income' and 'Spending Score' columns
df=df.rename(columns={"Annual Income (k$)": "Annual_Income_$", "Spending Score (1-100)": "Spending_Score"})

In [5]:
#Some information about Data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   CustomerID       200 non-null    int64
 1   Genre            200 non-null    object
 2   Age              200 non-null    int64
 3   Annual_Income_$  200 non-null    int64
 4   Spending_Score   200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [6]:
#Statistics information about Data, include numerical columns
df.describe()

       CustomerID         Age  Annual_Income_$  Spending_Score
count  200.000000  200.000000       200.000000      200.000000
mean   100.500000   38.850000        60.560000       50.200000
std     57.879185   13.969007        26.264721       25.823522
min      1.000000   18.000000        15.000000        1.000000
25%     50.750000   28.750000        41.500000       34.750000
50%    100.500000   36.000000        61.500000       50.000000
75%    150.250000   49.000000        78.000000       73.000000
max    200.000000   70.000000       137.000000       99.000000

In [7]:
#Statistics information about Data, include categorical columns
df.describe(exclude='number')

         Genre
count      200
unique       2
top     Female
freq       112

In [8]:
#Check missing values
df.isna().any()

CustomerID         False
Genre              False
Age                False
Annual_Income_$    False
Spending_Score     False
dtype: bool

In [9]:
#Check duplicated values in data
df.duplicated().any()

False

**The Data have 200 rows and 5 columns.**

**No Missing Values in Data.**

**No Duplicate Values in Data.**